app/controllers/best_laps_controller.rb

  def index
    @best_laps = BestLap.all
---
SELECT "best_laps".* FROM "best_laps"