app/controllers/drivers_controller.rb

  def index
    @drivers = Driver.all
---
SELECT "drivers".* FROM "drivers"

  def show
    @driver = Driver.find(params[:id])
---
SELECT "drivers".* FROM "drivers" WHERE "drivers"."id" = 1 LIMIT 1

  def create
    @driver = Driver.new(params[:driver])

    respond_to do |format|
      if @driver.save
---
INSERT INTO "drivers" ("created_at", "updated_at", "name") VALUES ('2011-05-31 02:40:02.474426', '2011-05-31 02:40:02.474426', 'Lennon Jesus')