app/controllers/positions_controller.rb

  def index
    @positions = Position.all
---
SELECT "positions".* FROM "positions"

  def show
    @position = Position.find(params[:id])
---
SELECT "positions".* FROM "positions" WHERE "positions"."id" = 1 LIMIT 1

  def create
    @position = Position.new(params[:position])

    respond_to do |format|
      if @position.save
---
INSERT INTO "positions" ("updated_at", "driver_id", "created_at", "race_id") VALUES ('2011-05-31 02:41:01.017027', NULL, '2011-05-31 02:41:01.017027', NULL)