app/controllers/races_controller.rb

  def index
    @races = Race.all
---
SELECT "races".* FROM "races"

  def show
    @race = Race.find(params[:id])
---
SELECT "races".* FROM "races" WHERE "races"."id" = 1 LIMIT 1

  def create
    @race = Race.new(params[:race])

    respond_to do |format|
      if @race.save
---
INSERT INTO "races" ("updated_at", "created_at", "date") VALUES ('2011-05-29 23:47:10.583691', '2011-05-29 23:47:10.583691', '2011-05-29 23:46:00.000000')