app/controllers/services_controller.rb

  def index
    @services = current_user.services.order('provider asc')
---
SELECT "services".* FROM "services" WHERE ("services".user_id = 1) ORDER BY provider asc

  def newaccount
    if params[:commit] == "Cancel"
      session[:authhash] = nil
      session.delete :authhash
      redirect_to root_url
    else  # create account
      @newuser = User.new
      @newuser.name = session[:authhash][:name]
      @newuser.email = session[:authhash][:email]
      @newuser.services.build(:provider => session[:authhash][:provider], :uid => session[:authhash][:uid], :uname => session[:authhash][:name], :uemail => session[:authhash][:email])

      if @newuser.save!
---
INSERT INTO "services" ("provider", "user_id", "uid", "uname", "updated_at", "created_at", "uemail") VALUES ('google', 1, 'https://www.google.com/accounts/o8/id?id=AItOawmxH5YfZaMrzQYAn1LPAMtiX8WuQDpaBXI', 'Lennon Jesus', '2011-05-29 17:54:39.940827', '2011-05-29 17:54:39.940827', 'lennon.jesus@gmail.com')
INSERT INTO "users" ("email", "name", "updated_at", "created_at") VALUES ('apps+164681996927233.1316990523.cc55e6cc16a2e3cfd4a17c38d6e92220@proxymail.facebook.com', 'Lennon Jesus', '2011-05-29 18:13:05.442959', '2011-05-29 18:13:05.442959')


      if @authhash[:uid] != '' and @authhash[:provider] != ''

        auth = Service.find_by_provider_and_uid(@authhash[:provider], @authhash[:uid])
---
SELECT "services".* FROM "services" WHERE "services"."uid" = 'https://www.google.com/accounts/o8/id?id=AItOawmxH5YfZaMrzQYAn1LPAMtiX8WuQDpaBXI' AND "services"."provider" = 'google' LIMIT 1

            flash[:notice] = 'A conta ' + @authhash[:provider].capitalize + ' Ja está associada a este aplicativo.'
            redirect_to services_path
          else
            current_user.services.create!(:provider => @authhash[:provider], :uid => @authhash[:uid], :uname => @authhash[:name], :uemail => @authhash[:email])
---
INSERT INTO "services" ("user_id", "uid", "updated_at", "provider", "uname", "created_at", "uemail") VALUES (2, '36691', '2011-05-29 18:13:58.168597', 'github', 'Lennon Jesus', '2011-05-29 18:13:58.168597', '')