app/controllers/users_controller.rb

  def admin
    @users = User.all
---
SELECT "users".* FROM "users"